package response

const (
	// 成功
	CodeSuccess = 0

	// =========================
	// 400 参数相关
	// =========================

	CodeInvalidParams = 40001

	// =========================
	// 401 认证相关
	// =========================

	CodeUnauthorized = 40101

	// =========================
	// 403 权限相关
	// =========================

	CodeForbidden = 40301

	// =========================
	// 404 资源相关
	// =========================

	CodeNotFound       = 40401
	CodeNotImplemented = 50101

	// =========================
	// 500 系统相关
	// =========================

	CodeInternalError = 50001
	CodeDatabaseError = 50002
)
